Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/debt_settlement_arrangements.html.txt.tmx
Source language: en
Languages: ga

source: In general, you must act in good faith and co-operate fully with the process
ga: Go ginearálta, ní mór duit gníomhú le hintinn mhaith agus comhoibriú go hiomlán leis an bpróiseas

source: The ISI has published detailed information on fees
ga: D’fhoilsigh an ISI faisnéis mhionsonraithe faoi tháillí

source: A fee of €250 was payable to the ISI for the issue of a protective certificate – described below
ga: Bhíodh táille €250 iníoctha leis an ISI as deimhniú cosanta (féach thíos) a eisiúint

source: There is no set scale of fees for PIPs, but they are required to specify their charges and associated costs clearly before being appointed to act on your behalf
ga: Ní ann d’aon scála socraithe táillí do PIPanna, ach ceanglaítear orthu a dtáillí agus a gcostais ghaolmhara a shonrú sula gceaptar iad chun gníomhú thar do cheann

source: The Personal Insolvency Practitioner sends your application to the Insolvency Service
ga: Seolann an Cleachtóir um Dhócmhainneacht Phearsanta d’iarratas chuig an tSeirbhís Dócmhainneachta

source: The ISI checks that all the details are in order and, if so, issues a certificate to that effect and forwards all the documentation to the relevant court (the Circuit Court in cases up to €2.5 million and the High Court in larger cases)
ga: Déanann an ISI cinnte go bhfuil na sonraí go léir i gceart agus, má tá, eisíonn sí deimhniú chuige sin agus cuireann sí na doiciméid go léir ar aghaidh chuig an gcúirt ábhartha (an Chúirt Chuarda i gcásanna suas go dtí €2.5 milliún agus an Ard-Chúirt i gcásanna níos mó)

source: The court reviews the documentation and, if all is in order, issues a protective certificate
ga: Déanann an chúirt athbhreithniú ar na doiciméid agus, má tá gach ní i gceart, eiseoidh sí deimhniú cosanta

source: The Insolvency Service records the details of the protective certificate on its Register of Protective Certificates
ga: Taifeadann an tSeirbhís Dócmhainneachta sonraí an deimhnithe cosanta ar a Clár um Dheimhnithe Cosanta

source: The Personal Insolvency Practitioner then notifies each of your creditors of the existence of the protective certificate and your intention to make a proposal for a DSA
ga: Cuireann an Cleachtóir um Dhócmhainneacht Phearsanta in iúl do gach ceann de do chreidiúnaithe ansin go bhfuil deimhniú cosanta ann agus go bhfuil sé beartaithe agat togra le haghaidh DSA a dhéanamh

source: The protective certificate will give you 70 days during which your creditors may not:
ga: Tabharfaidh an deimhniú cosanta 70 lá duit nach féidir le creidiúnaithe na nithe seo a leanas a dhéanamh lena linn:

source: • Start or continue legal proceedings in respect of the debt
ga: • Imeachtaí dlí i leith an fhiachais a thosú ná leanúint d’imeachtaí dlí

source: • Take or continue any steps to enforce a judgment or contact you about the debt unless you agree to this
ga: • Aon bhearta a dhéanamh ná leanúint d’aon bhearta d’fhonn breithiúnas a fhorghníomhú ná dul i dteagmháil leat i dtaobh an fhiachais mura gcomhaontaíonn tú leis sin

source: • Start or continue bankruptcy proceedings against you
ga: • Imeachtaí dlí i d’aghaidh a thosú ná leanúint d’imeachtaí dlí i d’aghaidh

source: The court may extend the period of the protective certificate by a further 40 days if it is satisfied that:
ga: Féadfaidh an chúirt tréimhse an deimhnithe cosanta a shíneadh le 40 lá sa bhreis más deimhin léi:

source: • You and the Personal Insolvency Practitioner have acted in good faith and with reasonable expedition, and
ga: • Gur ghníomhaigh tusa agus an Cleachtóir um Dhócmhainneacht Phearsanta le hintinn mhaith agus le brostú réasúnach, agus

source: • It is likely that, if the extension is granted, a proposal for a DSA will be made that is likely to be accepted by the creditors and successfully completed by you
ga: • Gur dócha, sa chás go ndeonaítear an síneadh, go ndéanfar togra le haghaidh DSA ar dóigh go nglacfar na creidiúnaithe leis agus go gcuirfidh tú i gcrích é go rathúil

source: A creditor may apply to the court for an order directing that the protective certificate not apply to him or her
ga: Féadfaidh creidiúnaí iarratas a dhéanamh chuig an gcúirt ar ordú lena dtugtar treoir nach mbeidh feidhm ag an deimhniú cosanta leis nó léi

source: The court will grant this order only if satisfied that failing to give it would cause irreparable loss to the creditor that would not otherwise occur and that no other creditor to whom notice of the protective certificate has been given would be unfairly prejudiced
ga: Ní dheonóidh an chúirt an t-ordú seo ach amháin más deimhin léi go mbeadh sé ina chúis le caillteanas doleasaithe don chreidiúnaí nach dtarlódh ar shlí eile mura dtabharfaí an t-ordú agus nach ndéanfaí dochar éagórach d’aon chreidiúnaí eile ar tugadh fógra dó/di faoin deimhniú cosanta

source: Formulating a DSA proposal
ga: Togra DSA a cheapadh

source: Once the protective certificate has been granted, your PIP must invite the relevant creditors to make proposals about the manner in which the debts might be dealt with as part of a DSA
ga: A luaithe is a dheonaítear an deimhniú cosanta, ní mór don PIP iarraidh ar na creidiúnaithe lena mbaineann tograí a dhéanamh faoin dóigh a bhféadfaí déileáil leis na fiacha mar chuid de DSA

source: The creditors must be given your Prescribed Financial Statement
ga: Ní mór do Ráiteas Airgeadais Forordaithe a thabhairt do na creidiúnaithe

source: In order to help the PIP to formulate the proposal, you will be required to provide an honest and accurate account of your living expenses, your life plans and any circumstances that may be relevant to how much of your debts you can pay, now and in the future
ga: D’fhonn cabhrú leis an PIP an togra a cheapadh, éileofar ort cuntas ionraic cruinn a chur ar fáil ar do chostais mhaireachtála, ar do phleananna saoil agus ar aon chúinsí a d’fhéadfadh a bheith ábhartha don mhéid de d’fhiacha a fhéadann tú a íoc faoi láthair agus a fhéadfaidh tú a íoc sa todhchaí

source: When formulating the proposal for a DSA, the PIP will ensure, as far as is reasonably practicable, that you are not required to sell or move out of your principal private residence (your home)
ga: Agus an togra le haghaidh DSA á cheapadh, cinnteoidh an PIP, a oiread is féidir go réasúnach, nach n-éileofar ort do phríomhtheach príobháideach (do theach) a dhíol ná bogadh amach as

source: If you wish to move out, or if the PIP believes that the running costs of staying in your home are disproportionately large, the DSA may provide for you to move out of it
ga: Más mian leat bogadh amach, nó má chreideann an PIP gur mór go díréireach atá na costais reatha chun fanacht i do theach, féadfaidh an DSA foráil a dhéanamh duit chun bogadh amach as

source: When you have consented to the proposal for a DSA that has been formulated by your PIP, the PIP must call a creditors’ meeting
ga: Nuair a thoilíonn tú leis an togra le haghaidh DSA ar cheap do PIP é, ní mór don PIP cruinniú na gcreidiúnaithe a ghairm

source: If there is only one creditor, he or she may write to the PIP indicating agreement or rejection
ga: Más rud nach bhfuil ach creidiúnaí amháin ann, féadfaidh sé nó sí scríobh chuig an PIP chun comhaontú nó diúltú a chur in iúl

source: The creditors vote on whether or not to accept the proposed arrangement
ga: Vótálann na creidiúnaithe ar cé acu a ghlacfaidh siad nó nach nglacfaidh siad leis an socrú beartaithe

source: Each vote is proportional to the amount of debt owed to that creditor
ga: Tá gach vóta i gcomhréir leis an méid fiachais atá dlite leis an gcreidiúnaí sin

source: In order for the arrangement to be accepted, creditors representing 65% or more of the value of your total unsecured debt must vote in favour of the proposal
ga: Le go nglacfar leis an socrú, ní mór do chreidiúnaithe a dhéanann ionadaíocht do 65% nó níos mó de luach d’fhiachais neamhurraithe iomláin vótáil i bhfabhar an togra

source: If the creditors reject the proposal, the protective certificate ceases to have effect and the DSA process will have come to an end
ga: Má dhiúltaíonn na creidiúnaithe don togra, ní bheidh éifeacht ag an deimhniú cosanta a thuilleadh agus beidh deireadh leis an bpróiseas DSA

source: If the proposal is accepted, the PIP must inform the Insolvency Service and tell creditors of their right to object to the relevant court - (the Circuit Court in cases up to €2.5 million and the High Court in larger cases)
ga: Má ghlactar leis an togra, caithfidh an PIP fógra a thabhairt don tSeirbhís Dócmhainneachta agus insint do chreidiúnaithe faoina gceart chun agóid a dhéanamh chuig an gcúirt ábhartha (an Chúirt Chuarda i gcásanna suas go dtí €2.5 milliún agus an Ard-Chúirt i gcásanna níos mó)

source: The Insolvency Service notifies the court
ga: Tugann an tSeirbhís Dócmhainneachta fógra don chúirt

source: If there is any objection, the protective certificate remains in place until the matter is decided
ga: Más rud é go bhfuil aon agóid ann, beidh an deimhniú cosanta i bhfeidhm go dtí go gcinnfear an t-ábhar

source: The grounds on which an objection to the coming into effect of the Debt Settlement Arrangement may be made are limited and include the following:
ga: Is teoranta atá an foras ar a bhféadfar agóid a dhéanamh in aghaidh theacht in éifeacht an tSocraithe Réitigh Fiachais agus áirítear na nithe seo a leanas leis:

source: • You arranged your affairs in the previous 2 years primarily with a view to becoming eligible for a Debt Settlement Arrangement or a Personal Insolvency Arrangement
ga: • D’eagraigh tú do chúrsaí sa 2 bhliain roimhe go príomha d’fhonn éirí incháilithe le haghaidh Socrú Réitigh Fiachais nó Socraithe um Dhócmhainneacht Phearsanta

source: • The procedural requirements were not followed
ga: • Níor leanadh na riachtanais nós imeachta

source: • A material inaccuracy or omission exists in your Prescribed Financial Statement that causes a material detriment to the creditor
ga: • Tá míchruinneas ábhartha nó easnamh i do Ráiteas Airgeadais Forordaithe atá mar chúis le dochar ábhartha don chreidiúnaí

source: • You did not meet the requirements when the arrangement was proposed
ga: • Níor chomhlíon tú na riachtanais nuair a beartaíodh an socrú

source: • The arrangement unfairly prejudices the interests of a creditor
ga: • Déanann an socrú dochar éagórach do leasanna creidiúnaí

source: • You have committed an offence under the personal insolvency legislation
ga: • Rinne tú coir faoin reachtaíocht um dhócmhainneacht phearsanta

source: • You have entered into a transaction at an undervalue or given a preference to a person in the previous three years that has materially contributed to your inability to pay your debts
ga: • Chuaigh tú isteach in idirbheart ag gannluach nó thug tú tosaíocht do dhuine sna trí bliana roimhe sin a chuir, ar bhealach ábhartha, le do neamhábaltacht chun d’fhiacha a íoc

source: Issuing a Debt Settlement Arrangement
ga: Socrú Réitigh Fiachais a eisiúint

source: If there is no objection or an objection is not upheld, the court approves the Debt Settlement Arrangement if satisfied that all the conditions have been met
ga: Mura ndéantar aon agóid nó mura seastar le hagóid, ceadóidh an chúirt an Socrú Réitigh Fiachais más deimhin leis gur comhlíonadh na coinníollacha go léir

source: The Insolvency Service records the DSA in its Register of Debt Settlement Arrangements and it comes into effect. Deferring Local Property Tax
ga: Taifeadann an tSeirbhís Dócmhainneachta an DSA ina Clár um Shocruithe Réitigh Fiachais agus tagann sé in éifeacht

source: Varying or ending a Debt Settlement Arrangement
ga: Socrú Réitigh Fiachais a athrú nó deireadh a chur leis

source: Debt Settlement Arrangements may be varied if there is a material change in a debtor’s circumstances that would affect his/her ability to make repayments under the DSA – the procedures are similar to those for setting up the arrangement
ga: Féadfar Socruithe Réitigh Fiachais a athrú má tá athrú ábhartha ar chúinsí féichiúnaí a rachadh i bhfeidhm ar a (h)ábaltacht chun aisíocaíochtaí a dhéanamh faoin DSA - tá na nósanna imeachta cosúil leo sin le haghaidh an socrú a bhunú

source: A creditor or a PIP may apply to the court at any time during the Debt Settlement Arrangement to have it ended
ga: Féadfaidh creidiúnaí nó PIP iarratas a dhéanamh chuig an gCúirt tráth ar bith le linn an tSocraithe Réitigh Fiachais ar dheireadh a chur leis

source: The grounds for such an application will be limited and include the following:
ga: Is teoranta a bheidh an foras le haghaidh iarratais den chineál sin agus áirítear na nithe seo a leanas leis:

source: • Your Prescribed Financial Statement has a material inaccuracy or omission that causes a material detriment to the creditor
ga: • Tá míchruinneas ábhartha nó easnamh i do Ráiteas Airgeadais Forordaithe atá mar chúis le dochar ábhartha don chreidiúnaí

source: • You did not meet the eligibility criteria when you started the process
ga: • Níor chomhlíon tú na critéir cháilitheachta nuair a thosaigh tú an próiseas

source: • You did not comply with the terms of the Debt Settlement Arrangement
ga: • Níor chloígh tú le téarmaí an tSocraithe Réitigh Fiachais

source: • You have committed an offence under the personal insolvency legislation since the arrangement came into effect
ga: • Rinne tú coir faoin reachtaíocht um dhócmhainneacht phearsanta ó tháinig an socrú in éifeacht

source: • You are in arrears with your payments for a period of not less than 3 months
ga: • Tá tú i riaráiste le d’íocaíochtaí ar feadh tréimhse nach lú ná 3 mhí

source: The full list of grounds is in Section 83 of the Personal Insolvency Act 2012
ga: Tá an liosta iomlán forais in Alt 83 den Acht um Dhócmhainneacht Phearsanta 2012

source: If you are in arrears with your payments for more than 6 months, the DSA will be deemed to have failed
ga: Má tá tú i riaráiste le d’íocaíochtaí ar feadh níos mó ná 6 mhí, measfar gur theip ar an DSA

source: This will be recorded in the Register of Debt Settlement Arrangements
ga: Taifeadtar é sin sa Chlár um Shocruithe Réitigh Fiachais

source: When a Debt Settlement Arrangement ends
ga: Nuair atá deireadh le Socrú Réitigh Fiachais

source: If the arrangement ends other than by successful completion, you become fully liable for all specified debts, including arrears, charges and interest that have accrued during the DSA period, less any payments made by you during that time, unless the terms of the DSA specify, or the court has ordered, otherwise
ga: Más é rud ar bith eile seachas cur i gcrích rathúil is cúis le deireadh an tsocraithe, éireoidh tú faoi dhliteanas iomlán as gach fiach sonraithe, lena n-áirítear riaráiste, muirir agus ús a fabhraíodh le linn na tréimhse DSA, lúide aon íocaíochtaí a rinne tú le linn na tréimhse sin, mura sonraítear a mhalairt i dtéarmaí an DSA nó murar ordaigh an chúirt a mhalairt

source: If the arrangement is successfully completed, you are discharged from the debts covered by the DSA
ga: Má chuirtear an socrú i gcrích go rathúil, urscaoilfear thú ó na fiacha a gclúdaíonn an DSA iad

source: The successful completion is recorded on the Register of Debt Settlement Arrangements
ga: Taifeadtar an cur i gcrích rathúil sa Chlár um Shocruithe Réitigh Fiachais

source: You are now solvent
ga: Tá tú sócmhainneach anois

source: Your application for a Debt Settlement Arrangement must be made through a through a Personal Insolvency Practitioner (PIP)
ga: Ní mór d’iarratas ar Shocrú Réitigh Fiachais a dhéanamh trí Chleachtóir um Dhócmhainneacht Phearsanta (PIP)

source: You can choose one from the Register of Personal Insolvency Practitioners that is published by the ISI
ga: Is féidir leat PIP a roghnú ó Chlár na gCleachtóirí Dócmhainneachta Pearsanta a bhfoilsíonn an ISI é

source: Further information is available from the ISI’s helpline 0761 06 4200 (Monday to Friday, 9 am to 6 pm) and from its main website isi.gov.ie, as well as its website backontrack.ie for people who are struggling with debt
ga: Tá tuilleadh faisnéise ar fáil ó líne chabhrach an ISI, 0761 06 4200 (Luan go hAoine, 9am go 6pm), óna láithreán gréasáin ag isi.gov.ie agus ón láithrean backontrack.ie, atá dírithe ar dhaoine a bhfuil fadhbanna fiachais acu
